import numpy as np

# 两个数组合并
a = np.array([[1, 2, 3],
              [4, 5, 6]])
b = np.array([[7, 8, 9],
              [10, 11, 12]])

print('纵向拼接：\n', np.vstack([a, b]))
# 输出
# 纵向拼接：
#  [[ 1  2  3]
#  [ 4  5  6]
#  [ 7  8  9]
#  [10 11 12]]

print('横向拼接：\n', np.hstack([a, b]))
# 输出
# 横向拼接：
#  [[ 1  2  3  7  8  9]
#  [ 4  5  6 10 11 12]]

# 切片，就是截取子数组的意思
a = np.array([[1, 2, 3, 4, 5, 6],
              [4, 5, 6, 7, 8, 9],
              [7, 8, 9, 10, 11, 12],
              [10, 11, 12, 13, 14, 15]])

print('切取 1:3行，2:4列的子数组：\n', a[1:4, 2:5])
# 输出 切取 1:3行，2:4列的子数组：
#  [[6]]

print('切取前3行，后4列的子数组：\n', a[:3, -4:])
# 输出 切取前3行，后4列的子数组：
#  [[1 2 3]
#  [4 5 6]]
